Tekla Open API Reference for Tekla Structures 2025
IFCExportFlags Properties
The Operation.IFCExportFlags type exposes the following members.
Properties
Name | Description
UseIfcMapConversion
 Boolean indicating whether to use IfcMapConversion with base points is enabled. By default IFC4 export should use IfcMapConversion. Uninitialized null will be converted to true during export.
Top
See Also
Reference
Operation.IFCExportFlags Structure
Tekla.Structures.Model.Operations Namespace